// -----------------------------------------------------------------
// Constructor Design Pattern
// -----------------------------------------------------------------
// JavaScript 객체(인스턴스) 생성을 동일 프로세스를 사용해 생성하는 패턴입니다.
// -----------------------------------------------------------------


// 디자인 패턴이 전통적인 객체 지향 프로그래밍(OOP)에서 온 걸 생각한다면?
// 클래스를 사용해 객체를 생성하는 다른 언어(Java, C# 등)와 마찬가지로
// JavaScript에서도 클래스를 사용해 객체를 생성할 수 있습니다.

  // - 클래스 class
  // - 생성자 function


// 클래스 외 다양한 방법도 JavaScript에서는 사용 가능합니다.

  // - 객체 리터럴 {}
  // - Object.create()
  // - new Object()
